Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              [(None, 41, 60, 60)] 0                                            
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 41, 60, 60)   240         input[0][0]                      
__________________________________________________________________________________________________
gaussian_noise (GaussianNoise)  (None, 41, 60, 60)   0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 64, 60, 60)   23680       gaussian_noise[0][0]             
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 64, 60, 60)   240         conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 64, 60, 60)   36928       batch_normalization_1[0][0]      
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 64, 30, 30)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 64, 30, 30)   120         average_pooling2d[0][0]          
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 30, 30)  73856       batch_normalization_2[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128, 30, 30)  120         conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 30, 30)  147584      batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128, 30, 30)  120         conv2d_3[0][0]                   
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 128, 15, 15)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 128, 15, 15)  7680        average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 256, 15, 15)  295168      batch_normalization_5[0][0]      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 256, 15, 15)  15360       conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 15, 15)  295040      batch_normalization_6[0][0]      
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 128, 30, 30)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 128, 30, 30)  15360       up_sampling2d[0][0]              
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 30, 30)  147584      batch_normalization_7[0][0]      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 128, 30, 30)  120         conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 30, 30)  147584      batch_normalization_8[0][0]      
__________________________________________________________________________________________________
add (Add)                       (None, 128, 30, 30)  0           conv2d_7[0][0]                   
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 128, 60, 60)  0           add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 128, 60, 60)  240         up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 64, 60, 60)   73792       batch_normalization_9[0][0]      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 64, 60, 60)   240         conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 60, 60)   36928       batch_normalization_10[0][0]     
__________________________________________________________________________________________________
add_1 (Add)                     (None, 64, 60, 60)   0           conv2d_9[0][0]                   
                                                                 conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 64, 60, 60)   15360       add_1[0][0]                      
__________________________________________________________________________________________________
output (Conv2D)                 (None, 1, 60, 60)    65          batch_normalization_11[0][0]     
==================================================================================================
Total params: 1,333,409
Trainable params: 1,305,809
Non-trainable params: 27,600
__________________________________________________________________________________________________
