Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input (InputLayer)              [(None, 60, 60, 39)] 0
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 60, 60, 39)   156         input[0][0]
__________________________________________________________________________________________________
gaussian_noise (GaussianNoise)  (None, 60, 60, 39)   0           batch_normalization[0][0]
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 60, 60, 16)   5632        gaussian_noise[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 60, 60, 16)   2320        conv2d[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 60, 60, 16)   64          conv2d_1[0][0]
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 30, 30, 16)   0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 30, 30, 32)   4640        average_pooling2d[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 30, 30, 32)   128         conv2d_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 30, 30, 32)   9248        batch_normalization_2[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 30, 30, 32)   128         conv2d_3[0][0]
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 60, 60, 32)   0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 60, 60, 48)   0           up_sampling2d[0][0]
                                                                 batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 60, 60, 16)   6928        concatenate[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 60, 60, 16)   64          conv2d_4[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 60, 60, 16)   2320        batch_normalization_4[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 60, 60, 16)   64          conv2d_5[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 60, 60, 16)   2320        batch_normalization_5[0][0]
__________________________________________________________________________________________________
output (Conv2D)                 (None, 60, 60, 1)    17          conv2d_6[0][0]
==================================================================================================
Total params: 34,029
Trainable params: 33,727
Non-trainable params: 302
__________________________________________________________________________________________________
